Repository: rahim2306/mokrabela
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# appTitle
source: MokraBela
ar: موكرابيلا

source: Welcome
ar: مرحبا
fr: Bienvenue

# hello
source: Hello, {name}!
ar: مرحبا، {name}!
fr: Bonjour, {name}!

# languageSelector
source: Select Language
ar: اختر اللغة
fr: Sélectionner la langue

source: English
ar: الإنجليزية
fr: Anglais

source: French
ar: الفرنسية
fr: Français

source: Arabic
ar: العربية
fr: Arabe

source: Change Language
ar: تغيير اللغة
fr: Changer de langue

# currentLanguage
source: Current Language: {language}
ar: اللغة الحالية: {language}
fr: Langue actuelle: {language}

source: Welcome to MokraBela
ar: مرحبًا بكم في موكرابيلا
fr: Bienvenue sur MokraBela

# welcomeSubtitle
source: Helping children feel calmer, more focused, and supported—together.
ar: نساعد الأطفال على الشعور بالهدوء، وزيادة التركيز، والدعم معًا.
fr: Aider les enfants à se sentir plus calmes, plus concentrés et mieux accompagnés, ensemble.

source: Get Started
ar: ابدأ الآن
fr: Commencer

source: Log in
ar: تسجيل الدخول
fr: Se connecter

source: Welcome Back
ar: مرحبا بعودتك
fr: Bon retour

# loginSubtitle
source: Sign in to continue your journey.
ar: سجل الدخول لمتابعة رحلتك.
fr: Connectez-vous pour continuer votre parcours.

# loginFailed
source: Login failed. Please check your credentials.
ar: فشل تسجيل الدخول. يرجى التحقق من بيانات الاعتماد.
fr: Échec de la connexion. Veuillez vérifier vos identifiants.

# dontHaveAccount
source: Don't have an account?
ar: ليس لديك حساب؟
fr: Vous n'avez pas de compte?

# alreadyHaveAccount
source: Already have an account?
ar: هل لديك حساب بالفعل؟
fr: Vous avez déjà un compte?

# onboardingQuestion1
source: Which sentence describes you the best?
ar: أي جملة تصفك بشكل أفضل؟
fr: Quelle phrase vous décrit le mieux?

# optionParent
source: I am a parent who wants to monitor my child's progress.
ar: أنا ولي أمر أريد متابعة تقدم طفلي.
fr: Je suis un parent qui souhaite suivre les progrès de mon enfant.

# optionTeacher
source: I am a teacher who works with students.
ar: أنا معلم أعمل مع الطلاب.
fr: Je suis un enseignant qui travaille avec des élèves.

source: Next
ar: التالي
fr: Suivant

source: Back
ar: رجوع
fr: Retour

source: Skip
ar: تخطي
fr: Passer

# intro1Title
source: Support Comes First
ar: الدعم أولًا
fr: Le soutien avant tout

# intro1Description
source: Children don't regulate alone. With guidance from parents and teachers, calm becomes a habit.
ar: الأطفال لا ينظمون أنفسهم وحدهم. بتوجيه من الأولياء والمعلمين، يصبح الهدوء عادة.
fr: Les enfants ne s'autorégulent pas seuls. Avec l'accompagnement des parents et des enseignants, le calme devient une habitude.

# intro2Title
source: Building Inner Calm
ar: بناء الهدوء الداخلي
fr: Construire le calme intérieur

# intro2Description
source: Step by step, children learn to calm themselves, focus better, and feel in control.
ar: خطوة بخطوة، يتعلم الأطفال كيف يهدؤون أنفسهم، ويحسنون تركيزهم، ويشعرون بالتحكم.
fr: Pas à pas, les enfants apprennent à se calmer, à mieux se concentrer et à se sentir en contrôle.

# welcomeChild
source: Welcome, {name}!
ar: مرحبًا، {name}!
fr: Bienvenue, {name}!

# watchConnected
source: Connected
ar: متصل
fr: Connecté

# watchDisconnected
source: Disconnected
ar: غير متصل
fr: Déconnecté

source: Daily Progress
ar: التقدم اليومي
fr: Progrès quotidien

source: Today's Calm Time
ar: وقت الهدوء اليوم
fr: Temps calme aujourd'hui

source: minutes
ar: دقيقة

source: Daily Calm Goal
ar: هدف الهدوء اليومي
fr: Objectif quotidien de calme

source: Goal reached!
ar: تم الوصول للهدف!
fr: Objectif atteint!

# tasksRemaining
source: {count} Tasks Remaining
ar: {count} مهام متبقية
fr: {count} tâches restantes

# breathingExercise
source: Breathing
ar: التنفس
fr: Respiration

source: Focus Games
ar: ألعاب التركيز
fr: Jeux de concentration

source: Calm Music
ar: موسيقى هادئة
fr: Musique calme

source: Stories
ar: قصص
fr: Histoires

# missingSquare
source: The Missing Square
ar: المربع المفقود
fr: Le carré manquant

source: Protocol
ar: البروتوكول
fr: Protocole

source: Focus Timer
ar: مؤقت التركيز
fr: Minuteur de concentration

source: Add Task
ar: أضف مهمة
fr: Ajouter une tâche

source: My Tasks
ar: مهامي
fr: Mes tâches

source: Start
ar: بدء
fr: Démarrer

source: Pause
ar: إيقاف مؤقت

source: Resume
ar: استئناف
fr: Reprendre

source: Reset
ar: إعادة ضبط
fr: Réinitialiser

source: Task Title
ar: عنوان المهمة
fr: Titre de la tâche

# duration
source: Duration (min)
ar: المدة (دقيقة)
fr: Durée (min)

source: Cancel
ar: إلغاء
fr: Annuler

source: Save
ar: حفظ
fr: Enregistrer

# helloLabel
source: Hello
ar: مرحباً
fr: Bonjour

# letsStartProtocol
source: Let's start your protocol
ar: لنبدأ بروتوكولك
fr: Commençons ton protocole

# missingSquareProtocol
source: Why use the protocol?
ar: لماذا هذا البروتوكول؟
fr: Pourquoi ce protocole ?

# protocolWelcome
source: Hello {userName}, let's start your protocol
ar: مرحباً {userName}، لنبدأ بروتوكولك
fr: Bonjour {userName}, commençons ton protocole

# protocolExplanation
source: These 4 squares help you understand feelings, control energy, and find peace.
ar: تساعدك هذه المربعات الـ 4 على فهم مشاعرك، والتحكم في طاقتك، والعثور على السلام.
fr: Ces 4 carrés t'aident à comprendre tes émotions, contrôler ton énergie et trouver la paix.

# square1Title
source: Self Awareness
ar: الوعي الذاتي
fr: Conscience de Soi

# square1Desc
source: Understand your feelings
ar: افهم مشاعرك
fr: Comprends tes émotions

# square2Title
source: Self Regulation
ar: التنظيم الذاتي
fr: Autorégulation

# square2Desc
source: Control your energy
ar: تحكم في طاقتك
fr: Contrôle ton énergie

# square3Title
source: Daily Tasks
ar: المهام اليومية
fr: Tâches Quotidiennes

# square3Desc
source: Organize your time
ar: نظم وقتك
fr: Organise ton temps

# square4Title
source: Psychological Calming
ar: التهدئة النفسية
fr: Apaisement Psychologique

# square4Desc
source: Find your peace
ar: اعثر على سلامك
fr: Trouve ta paix

source: Achievements
ar: الإنجازات
fr: Réussites

source: Tap to start
ar: اضغط للبدء
fr: Appuyez pour commencer

source: Good Morning
ar: صباح الخير
fr: Bonjour

source: Language
ar: اللغة
fr: Langue

source: Log Out
ar: تسجيل الخروج
fr: Se déconnecter

source: Tasks
ar: المهام
fr: Tâches

source: Manage your time well
ar: أدر وقتك بشكل جيد
fr: Gérez bien votre temps

# onboardingQuestion2
source: When would you like to check in daily?
ar: متى تريد تسجيل الدخول يوميًا؟
fr: À quelle heure souhaiteriez-vous faire votre bilan quotidien ?

# reminderHabitText
source: A gentle reminder helps you build a habit.
ar: التذكير اللطيف يساعدك على بناء عادة.
fr: Un rappel doux vous aide à instaurer une habitude.

source: AM
ar: صباحاً

source: PM
ar: مساءً

# tellUsMoreTitle
source: Tell us more about yourself
ar: أخبرنا المزيد عن نفسك
fr: Dites-nous en plus sur vous

# tellUsMoreSubtitle
source: Choose a few words that fit for you
ar: اختر بعض الكلمات التي تناسبك
fr: Choisissez quelques mots qui vous correspondent

source: Profile image
ar: صورة الملف الشخصي
fr: Image de profil

source: Full Name
ar: الاسم الكامل
fr: Nom complet

source: First Name
ar: الاسم الأول
fr: Prénom

source: Family Name
ar: اسم العائلة
fr: Nom de famille

source: Email
ar: البريد الإلكتروني

source: Password
ar: كلمة المرور
fr: Mot de passe

source: Phone Number
ar: رقم الهاتف
fr: Numéro de téléphone

source: Date of Birth
ar: تاريخ الميلاد
fr: Date de naissance

source: Gender
ar: الجنس
fr: Genre

source: Male
ar: ذكر
fr: Homme

source: Female
ar: أنثى
fr: Femme

source: Other
ar: آخر
fr: Autre

source: Prefer not to say
ar: أفضل عدم القول
fr: Préfère ne pas répondre

source: Go To Final Check in
ar: الانتقال إلى التسجيل النهائي
fr: Aller au bilan final

source: I am a...
ar: أنا...
fr: Je suis...

source: Sign Up
ar: التسجيل
fr: S'inscrire

# fieldRequired
source: This field is required
ar: هذا الحقل مطلوب
fr: Ce champ est obligatoire

# invalidEmail
source: Please enter a valid email
ar: يرجى إدخال بريد إلكتروني صالح
fr: Veuillez entrer un e-mail valide

# passwordTooShort
source: Password must be at least 6 characters
ar: يجب أن تتكون كلمة المرور من 6 أحرف على الأقل
fr: Le mot de passe doit comporter au moins 6 caractères

# invalidPhoneNumber
source: Please enter a valid phone number
ar: يرجى إدخال رقم هاتف صالح
fr: Veuillez entrer un numéro de téléphone valide

# registrationSuccess
source: Registration successful!
ar: تم التسجيل بنجاح!
fr: Inscription réussie !

# registrationFailed
source: Registration failed. Please try again.
ar: فشل التسجيل. يرجى المحاولة مرة أخرى.
fr: L'inscription a échoué. Veuillez réessayer.

# emailAlreadyInUse
source: This email is already in use
ar: هذا البريد الإلكتروني مستخدم بالفعل
fr: Cet e-mail est déjà utilisé

# weakPassword
source: Password is too weak
ar: كلمة المرور ضعيفة جدًا
fr: Le mot de passe est trop faible

# networkError
source: Network error. Please check your connection.
ar: خطأ في الشبكة. يرجى التحقق من اتصالك.
fr: Erreur réseau. Veuillez vérifier votre connexion.

source: Select gender
ar: اختر الجنس
fr: Sélectionner le genre

source: Select date
ar: اختر التاريخ
fr: Sélectionner la date

# languageShort
source: Eng
ar: عربي
fr: Fra

# breathingExercisesTitle
source: Breathing Exercises
ar: تمارين التنفس
fr: Exercices de respiration

# goldenBreathTitle
source: Golden Breath
ar: التنفس الذهبي
fr: Respiration dorée

# goldenBreathDesc
source: Short exercise (6s) for energy.
ar: تمرين قصير (6 ثوانٍ) للتحفيز والنشاط.
fr: Exercice court (6s) pour redonner de l'énergie.

# butterflyBreathTitle
source: Butterfly Breath
ar: تنفس الفراشة
fr: Respiration papillon

# butterflyBreathDesc
source: Calm exercise (10s) for deep relaxation.
ar: تمرين هادئ (10 ثوانٍ) للاسترخاء العميق.
fr: Exercice calme (10s) pour une relaxation profonde.

# oceanBreathTitle
source: Ocean Breath
ar: تنفس المحيط
fr: Respiration de l'océan

# oceanBreathDesc
source: Exercise (8s) mimicking ocean waves.
ar: تمرين (8 ثوانٍ) لمحاكاة هدوء الأمواج.
fr: Exercice (8s) imitant les vagues de l'océan.

# forestBreathTitle
source: Forest Breath
ar: تنفس الغابة
fr: Respiration de la forêt

# forestBreathDesc
source: Gentle exercise (7s) for balance.
ar: تمرين لطيف (7 ثوانٍ) للتوازن الطبيعي.
fr: Exercice doux (7s) pour l'équilibre.

source: Start {exercise}...
ar: بدء {exercise}...
fr: Démarrer {exercise}...

# whyBreatheTitle
source: Why breathe consciously?
ar: لماذا نتنفس بوعي؟
fr: Pourquoi respirer consciemment ?

# whyBreatheDesc
source: Breathing exercises help calm the mind, reduce stress, and improve focus. It's a magical way to recharge or relax.
ar: تساعد تمارين التنفس على تهدئة العقل، تقليل التوتر، وزيادة التركيز. إنها طريقة سحرية لشحن طاقتك أو الاسترخاء بعد يوم طويل وممتع.
fr: Les exercices de respiration aident à calmer l'esprit, réduire le stress et améliorer la concentration. C'est une façon magique de se ressourcer ou de se détendre.

# whyMusicTitle
source: Why listen to calm music?
ar: لماذا نستمع للموسيقى الهادئة؟
fr: Pourquoi écouter de la musique calme ?

# whyMusicDesc
source: Calm music helps create a peaceful environment, reduces anxiety, and enhances relaxation. It's perfect for meditation, study, or bedtime.
ar: تساعد الموسيقى الهادئة على خلق بيئة سلمية، تقليل القلق، وتعزيز الاسترخاء. إنها مثالية للتأمل، الدراسة، أو وقت النوم.
fr: La musique calme aide à créer un environnement paisible, réduit l'anxiété et favorise la relaxation. Elle est parfaite pour la méditation, l'étude ou le coucher.

# whyStoriesTitle
source: Why read stories?
ar: لماذا نقرأ القصص؟
fr: Pourquoi lire des histoires ?

# whyStoriesDesc
source: Stories spark imagination, teach valuable lessons, and help children relax. They're a wonderful way to wind down and dream big!
ar: القصص تشعل الخيال، تعلم دروساً قيمة، وتساعد الأطفال على الاسترخاء. إنها طريقة رائعة للاسترخاء والحلم بأشياء كبيرة!
fr: Les histoires stimulent l'imagination, enseignent des leçons précieuses et aident les enfants à se détendre. C'est une merveilleuse façon de décompresser et de rêver grand !

# whyFocusGamesTitle
source: Why play focus games?
ar: لماذا نلعب ألعاب التركيز؟
fr: Pourquoi jouer à des jeux de concentration ?

# whyFocusGamesDesc
source: Focus games help improve concentration, memory, and cognitive skills. It's a fun way to train your brain and boost mental agility!
ar: تساعد ألعاب التركيز على تحسين التركيز، الذاكرة، والمهارات المعرفية. إنها طريقة ممتعة لتدريب عقلك وتعزيز خفة الحركة الذهنية!
fr: Les jeux de concentration aident à améliorer la concentration, la mémoire et les capacités cognitives. C'est une façon amusante d'entraîner votre cerveau et de booster votre agilité mentale !

source: Breathe In
ar: استنشق
fr: Inspirez

source: Breathe Out
ar: ازفر
fr: Expirez

source: Cycle
ar: دورة

source: Complete!
ar: مكتمل!
fr: Terminé !

# breathingComplete
source: 🎉 {exercise} Complete! ✨
ar: 🎉 {exercise} مكتمل! ✨
fr: 🎉 {exercise} terminé ! ✨

# focusGamesTitle
source: Focus Games
ar: ألعاب التركيز
fr: Jeux de concentration

# memoryFlipTitle
source: Memory Flip
ar: قلب الذاكرة
fr: Mémoire Flip

# memoryFlipDesc
source: Match pairs of cards to improve memory and focus
ar: طابق أزواج البطاقات لتحسين الذاكرة والتركيز
fr: Associez les paires de cartes pour améliorer la mémoire et la concentration

source: Moves
ar: الحركات
fr: Coups

source: Time
ar: الوقت
fr: Temps

source: Game Complete!
ar: اللعبة مكتملة!
fr: Jeu terminé !

source: Play Again
ar: العب مرة أخرى
fr: Rejouer

source: Well Done!
ar: أحسنت!
fr: Bien joué !

# calmMusicTitle
source: Calm Music
ar: موسيقى هادئة
fr: Musique calme

source: Rain Sounds
ar: أصوات المطر
fr: Sons de pluie

# rainSoundsDesc
source: Gentle rain to calm your mind
ar: مطر لطيف لتهدئة عقلك
fr: Une pluie douce pour calmer votre esprit

source: Nature Ambience
ar: الطبيعة
fr: Ambiance nature

# natureAmbienceDesc
source: Peaceful sounds of nature
ar: أصوات الطبيعة الهادئة
fr: Sons paisibles de la nature

source: Ocean Waves
ar: أمواج البحر
fr: Vagues de l'océan

# oceanWavesDesc
source: Soothing ocean waves
ar: أمواج البحر المهدئة
fr: Vagues apaisantes de l'océan

# calmMusicTrack
source: Calm Music
ar: موسيقى هادئة
fr: Musique calme

# calmMusicTrackDesc
source: Relaxing melodies for peace
ar: ألحان مريحة للسلام
fr: Mélodies relaxantes pour la paix

# storiesTitle
source: Stories
ar: قصص
fr: Histoires

# braveStarTitle
source: The Brave Little Star
ar: النجمة الشجاعة
fr: La petite étoile courageuse

# braveStarDesc
source: A tale of courage and believing in yourself
ar: قصة عن الشجاعة والإيمان بالنفس
fr: Un conte de courage et de confiance en soi

# magicGardenTitle
source: The Magic Garden
ar: الحديقة السحرية
fr: Le jardin magique

# magicGardenDesc
source: Discover the magic of kindness
ar: اكتشف سحر اللطف
fr: Découvrez la magie de la gentillesse

# friendlyDragonTitle
source: The Friendly Dragon
ar: التنين الودود
fr: Le dragon amical

# friendlyDragonDesc
source: A heartwarming story about friendship
ar: قصة مؤثرة عن الصداقة
fr: Une histoire réconfortante sur l'amitié

# braveStarPage1
source: Once upon a time, in the vast night sky, there lived a little star named Stella. She was the smallest star in her constellation, but she had the biggest dreams.
ar: ذات مرة، في السماء الواسعة، عاشت نجمة صغيرة اسمها ستيلا. كانت أصغر نجمة في مجموعتها، لكن كانت لديها أكبر الأحلام.
fr: Il était une fois, dans le vaste ciel nocturne, une petite étoile nommée Stella. Elle était la plus petite étoile de sa constellation, mais elle avait les plus grands rêves.

# braveStarPage2
source: Every night, Stella watched the other stars shine brightly. "I wish I could shine as bright as them," she would whisper to the moon.
ar: كل ليلة، كانت ستيلا تشاهد النجوم الأخرى تتألق بشدة. "أتمنى أن أتألق مثلهم"، كانت تهمس للقمر.
fr: Chaque nuit, Stella regardait les autres étoiles briller intensément. « J'aimerais pouvoir briller aussi fort qu'elles », chuchotait-elle à la lune.

# braveStarPage3
source: One night, a dark cloud covered the sky. All the big stars hid behind it, afraid to shine. But Stella thought, "Someone needs to light the way for the children below."
ar: ذات ليلة، غطت سحابة مظلمة السماء. اختبأت كل النجوم الكبيرة خلفها خوفاً. لكن ستيلا فكرت: "يجب على أحد أن ينير الطريق للأطفال في الأسفل."
fr: Une nuit, un nuage sombre couvrit le ciel. Toutes les grandes étoiles se cachèrent derrière lui, craignant de briller. Mais Stella pensa : « Quelqu'un doit éclairer le chemin pour les enfants en bas. »

# braveStarPage4
source: With all her courage, Stella pushed through the cloud. It was hard and scary, but she kept going. Her light began to glow brighter and brighter!
ar: بكل شجاعتها، دفعت ستيلا عبر السحابة. كان الأمر صعباً ومخيفاً، لكنها استمرت. بدأ ضوؤها يتوهج أكثر فأكثر!
fr: Avec tout son courage, Stella traversa le nuage. C'était difficile et effrayant, mais elle continua. Sa lumière commença à briller de plus en plus fort !

# braveStarPage5
source: The children on Earth looked up and saw Stella's brave light. "Look! A shooting star!" they cheered. Stella realized she didn't need to be the biggest to make a difference.
ar: نظر الأطفال على الأرض ورأوا ضوء ستيلا الشجاع. "انظروا! نجم ساطع!" هتفوا. أدركت ستيلا أنها لا تحتاج لأن تكون الأكبر لتحدث فرقاً.
fr: Les enfants sur Terre levèrent les yeux et virent la lumière courageuse de Stella. « Regardez ! Une étoile filante ! » s'écrièrent-ils. Stella comprit qu'elle n'avait pas besoin d'être la plus grande pour faire une différence.

# braveStarPage6
source: From that night on, Stella shone with confidence. She learned that being brave doesn't mean you're not scared—it means you shine anyway. The End. ⭐
ar: من تلك الليلة فصاعداً، تألقت ستيلا بثقة. تعلمت أن الشجاعة لا تعني عدم الخوف - بل تعني أن تتألق على أي حال. النهاية. ⭐
fr: Depuis cette nuit-là, Stella brilla avec confiance. Elle apprit qu'être courageux ne signifie pas ne pas avoir peur, mais briller malgré tout. Fin. ⭐

# magicGardenPage1
source: In a quiet corner of the world, there was a magical garden that only appeared to those who truly believed in magic.
ar: في ركن هادئ من العالم، كانت هناك حديقة سحرية لا تظهر إلا لمن يؤمن بالسحر حقاً.
fr: Dans un coin tranquille du monde, il y avait un jardin magique qui n'apparaissait qu'à ceux qui croyaient vraiment à la magie.

# magicGardenPage2
source: A curious girl named Maya loved exploring. One sunny day, she followed a golden butterfly and discovered a hidden gate covered in vines.
ar: فتاة فضولية تدعى مايا كانت تحب الاستكشاف. في يوم مشمس، تبعت فراشة ذهبية واكتشفت بوابة مخفية مغطاة بالكروم.
fr: Une fille curieuse nommée Maya adorait explorer. Un jour ensoleillé, elle suivit un papillon doré et découvrit une porte cachée couverte de vignes.

# magicGardenPage3
source: As Maya touched the gate, it opened with a gentle glow. Inside was the most beautiful garden she had ever seen—flowers that sang, trees that danced, and streams that sparkled like diamonds.
ar: عندما لمست مايا البوابة، انفتحت بتوهج لطيف. بالداخل كانت أجمل حديقة رأتها على الإطلاق - زهور تغني، وأشجار ترقص، وجداول تتلألأ كالماس.
fr: Lorsque Maya toucha la porte, elle s'ouvrit avec une lueur douce. À l'intérieur se trouvait le plus beau jardin qu'elle ait jamais vu : des fleurs qui chantaient, des arbres qui dansaient et des ruisseaux qui scintillaient comme des diamants.

# magicGardenPage4
source: In the center of the garden stood a wise old tree. "Welcome, Maya," it said with a warm voice. "This garden grows from kindness and care. Will you help it bloom?"
ar: في وسط الحديقة وقفت شجرة حكيمة عجوز. "مرحباً يا مايا"، قالت بصوت دافئ. "هذه الحديقة تنمو من اللطف والرعاية. هل ستساعدينها على الازدهار؟"
fr: Au centre du jardin se tenait un vieil arbre sage. « Bienvenue, Maya », dit-il d'une voix chaleureuse. « Ce jardin grandit grâce à la gentillesse et aux soins. Veux-tu l'aider à s'épanouir ? »

# magicGardenPage5
source: Maya watered the flowers, sang to the trees, and helped the little creatures. With each kind act, the garden grew more vibrant and magical.
ar: سقت مايا الزهور، وغنت للأشجار، وساعدت المخلوقات الصغيرة. مع كل عمل لطيف، نمت الحديقة أكثر حيوية وسحراً.
fr: Maya arrosa les fleurs, chanta aux arbres et aida les petites créatures. À chaque acte de gentillesse, le jardin devenait plus vibrant et magique.

# magicGardenPage6
source: When it was time to leave, the tree gave Maya a special seed. "Plant this in your heart," it said. "Kindness is the real magic." Maya smiled, knowing she could create magic anywhere. The End. 🌸
ar: عندما حان وقت المغادرة، أعطت الشجرة مايا بذرة خاصة. "ازرعي هذه في قلبك"، قالت. "اللطف هو السحر الحقيقي." ابتسمت مايا، عالمة أنها تستطيع خلق السحر في أي مكان. النهاية. 🌸
fr: Au moment de partir, l'arbre donna à Maya une graine spéciale. « Plante ceci dans ton cœur », dit-il. « La gentillesse est la vraie magie. » Maya sourit, sachant qu'elle pouvait créer de la magie n'importe où. Fin. 🌸

# friendlyDragonPage1
source: High in the misty mountains lived a dragon named Ember. Unlike other dragons, Ember didn't want to guard treasure or breathe fire at knights.
ar: عالياً في الجبال الضبابية عاش تنين اسمه إمبر. على عكس التنانين الأخرى، لم يرد إمبر حراسة الكنوز أو إطلاق النار على الفرسان.
fr: Haut dans les montagnes brumeuses vivait un dragon nommé Ember. Contrairement aux autres dragons, Ember ne voulait pas garder de trésors ni cracher du feu sur les chevaliers.

# friendlyDragonPage2
source: Ember just wanted a friend. But whenever he flew down to the village, people would run away screaming. "I'm not scary!" Ember would call out, but no one stayed to listen.
ar: أراد إمبر فقط صديقاً. لكن كلما طار إلى القرية، كان الناس يهربون صارخين. "أنا لست مخيفاً!" كان إمبر ينادي، لكن لم يبق أحد ليستمع.
fr: Ember voulait simplement un ami. Mais chaque fois qu'il volait vers le village, les gens s'enfuyaient en criant. « Je ne suis pas effrayant ! » criait Ember, mais personne ne restait pour écouter.

# friendlyDragonPage3
source: One day, a brave little boy named Leo got lost in the mountains. As night fell and the cold wind blew, Leo began to cry. That's when he saw a warm, orange glow.
ar: في يوم من الأيام، ضاع صبي شجاع صغير اسمه ليو في الجبال. عندما حل الليل وهبت الرياح الباردة، بدأ ليو يبكي. حينها رأى توهجاً برتقالياً دافئاً.
fr: Un jour, un petit garçon courageux nommé Léo se perdit dans les montagnes. Alors que la nuit tombait et que le vent froid soufflait, Léo commença à pleurer. C'est alors qu'il vit une lueur orange chaleureuse.

# friendlyDragonPage4
source: It was Ember! The dragon gently breathed warm air to keep Leo cozy. "Don't be afraid," Ember said softly. "I'll help you get home."
ar: كان إمبر! نفخ التنين بلطف هواءً دافئاً ليبقي ليو مرتاحاً. "لا تخف"، قال إمبر بهدوء. "سأساعدك على العودة إلى المنزل."
fr: C'était Ember ! Le dragon souffla doucement de l'air chaud pour garder Léo au chaud. « N'aie pas peur », dit doucement Ember. « Je vais t'aider à rentrer chez toi. »

# friendlyDragonPage5
source: Ember flew Leo safely back to the village. When the people saw how kind and gentle the dragon was, they realized they had been wrong to judge him by his appearance.
ar: طار إمبر بليو بأمان إلى القرية. عندما رأى الناس كم كان التنين لطيفاً ورقيقاً، أدركوا أنهم كانوا مخطئين في الحكم عليه بمظهره.
fr: Ember ramena Léo en toute sécurité au village. Quand les gens virent à quel point le dragon était gentil et doux, ils comprirent qu'ils avaient eu tort de le juger sur son apparence.
