Repository: rahim2306/mokrabela
Catalog: lib/l10n/app_*.arb
Languages: ar, fr

# friendlyDragonPage6
source: From that day on, Ember had many friends in the village. He learned that true friendship comes to those who are kind and patient. And Leo learned that the biggest hearts sometimes come in the most unexpected forms. The End. 🐉
ar: من ذلك اليوم فصاعداً، كان لإمبر العديد من الأصدقاء في القرية. تعلم أن الصداقة الحقيقية تأتي لمن هم لطفاء وصبورون. وتعلم ليو أن أكبر القلوب تأتي أحياناً في أكثر الأشكال غير المتوقعة. النهاية. 🐉
fr: Depuis ce jour, Ember eut de nombreux amis dans le village. Il apprit que la véritable amitié vient à ceux qui sont gentils et patients. Et Léo apprit que les plus grands cœurs se cachent parfois sous les formes les plus inattendues. Fin. 🐉

# dtNewTask
source: New Task
ar: مهمة جديدة
fr: Nouvelle tâche

# dtTaskTitlePlaceholder
source: What do you want to focus on?
ar: على ماذا تريد التركيز؟
fr: Sur quoi veux-tu te concentrer ?

# dtTaskDurationLabel
source: Duration (minutes)
ar: المدة (دقيقة)
fr: Durée (minutes)

# dtAddButton
source: Add
ar: إضافة
fr: Ajouter

# dtCancelButton
source: Cancel
ar: إلغاء
fr: Annuler

source: How are you feeling?
ar: بماذا تشعر الآن؟
fr: Comment te sens-tu ?

# activityLevel
source: Activity Level (1-10)
ar: مستوى النشاط (1-10)
fr: Niveau d'activité (1-10)

source: Quiet
ar: هادئ
fr: Calme

source: Hyper
ar: نشيط جداً

source: Guided Body Scan
ar: مسح الجسم الموجه
fr: Scan corporel guidé

# bodyScanDesc
source: Check in with every part of your body.
ar: تحقق من كل جزء من أجزاء جسمك.
fr: Fais un bilan de chaque partie de ton corps.

# saveSession
source: Save My Session
ar: حفظ جلستي
fr: Enregistrer ma séance

# connectWatch
source: Connect Your Watch
ar: توصيل ساعتك
fr: Connecte ta montre

# watchScanning
source: Searching for your watch...
ar: البحث عن ساعتك...
fr: Recherche de ta montre...

source: Watch found!
ar: تم العثور على الساعة!
fr: Montre trouvée !

# watchConnecting
source: Connecting to your watch...
ar: جاري الاتصال بساعتك...
fr: Connexion à ta montre...

# watchError
source: Couldn't find your watch. Is it turned on?
ar: تعذر العثور على ساعتك. هل هي قيد التشغيل؟
fr: Impossible de trouver ta montre. Est-elle allumée ?

source: Pair Now
ar: اقرن الآن
fr: Jumeler maintenant

source: Available Devices
ar: الأجهزة المتاحة
fr: Appareils disponibles

# noDevicesFound
source: No devices found nearby.
ar: لم يتم العثور على أجهزة قريبة.
fr: Aucun appareil trouvé à proximité.

# retryScan
source: Scan Again
ar: إعادة المسح
fr: Relancer le scan

source: STOP Technique
ar: تقنية STOP
fr: Technique STOP

# stopStep1Title
source: S - Stop
ar: S - توقف

# stopStep1Desc
source: Stop what you are doing. Take a moment.
ar: توقف عما تفعله. خذ لحظة.
fr: Arrête ce que tu fais. Prends un instant.

# stopStep2Title
source: T - Take a Breath
ar: T - خذ نفساً
fr: T - Respire

# stopStep2Desc
source: Take a slow, deep breath. Feel it.
ar: خذ نفساً عميقاً وبطيئاً. اشعر به.
fr: Prends une respiration lente et profonde. Ressens-la.

# stopStep3Title
source: O - Observe
ar: O - لاحظ

# stopStep3Desc
source: Notice your thoughts and feelings.
ar: لاحظ أفكارك ومشاعرك.
fr: Remarque tes pensées et tes émotions.

# stopStep4Title
source: P - Proceed
ar: P - تقدم
fr: P - Continue

# stopStep4Desc
source: Continue with more calm and focus.
ar: استمر بمزيد من الهدوء والتركيز.
fr: Continue avec plus de calme et de concentration.

source: Breathe with me
ar: تنفس معي
fr: Respire avec moi

# feelingCooler
source: I'm feeling cooler now!
ar: أشعر بهدوء أكبر الآن!
fr: Je me sens plus calme maintenant !

source: Express Yourself
ar: عبر عن نفسك
fr: Exprime-toi

source: Mindfulness Prompts
ar: تمارين اليقظة
fr: Conseils de pleine conscience

source: Drawing Canvas
ar: لوحة الرسم
fr: Tableau de dessin

# clearCanvas
source: Clear
ar: مسح
fr: Effacer

# saveDrawing
source: Save
ar: حفظ
fr: Enregistrer

source: Calming Sounds
ar: أصوات هادئة
fr: Sons apaisants

source: Bedtime Stories
ar: قصص النوم
fr: Histoires du soir

source: Mindfulness
ar: اليقظة الذهنية
fr: Pleine conscience

source: Friend
ar: صديق
fr: Ami

# emotionHappy
source: Happy
ar: سعيد
fr: Heureux

# emotionSad
source: Sad
ar: حزين
fr: Triste

# emotionAngry
source: Angry
ar: غاضب
fr: En colère

# emotionAnxious
source: Anxious
ar: قلق
fr: Anxieux

# emotionCalm
source: Calm
ar: هادئ
fr: Calme

# emotionTired
source: Tired
ar: تعبان
fr: Fatigué

# reportSaved
source: Report saved! You are doing great.
ar: تم حفظ التقرير! أنت تقوم بعمل رائع.
fr: Rapport enregistré ! Tu t'en sors très bien.

# errorOccurred
source: Oops! Error: {error}
ar: عفواً! خطأ: {error}
fr: Oups ! Erreur : {error}

# bsStartFeetTitle
source: Start with Feet
ar: ابدأ بالقدمين
fr: Commence avec les pieds

# bsStartFeetDesc
source: Wiggle your toes. Feel them touching the floor. Relax them now.
ar: هز أصابع قدميك. اشعر بملامستها للأرض. أرخها الآن.
fr: Remue tes orteils. Sens-les toucher le sol. Détends-les maintenant.

# bsMovingLegsTitle
source: Moving to Legs
ar: التحرك إلى الساقين
fr: Passe aux jambes

# bsMovingLegsDesc
source: Tense your leg muscles for a second... and let them go loose.
ar: شد عضلات ساقك لمدة ثانية... ثم اتركها تسترخي.
fr: Contracte les muscles de tes jambes pendant une seconde... et relâche-les.

# bsRelaxTummyTitle
source: Relax Your Tummy
ar: أرخِ بطنك
fr: Détends ton ventre

# bsRelaxTummyDesc
source: Place your hand on your belly. Feel it rise and fall as you breathe.
ar: ضع يدك على بطنك. اشعر بارتفاعها وانخفاضها مع تنفسك.
fr: Pose ta main sur ton ventre. Sens-le monter et descendre en respirant.

# bsSoftShouldersTitle
source: Soft Shoulders
ar: أكتاف ناعمة
fr: Épaules souples

# bsSoftShouldersDesc
source: Bring your shoulders up to your ears... then drop them down heavy.
ar: ارفع كتفيك إلى أذنيك... ثم أنزلهما بوزن ثقيل.
fr: Monte tes épaules jusqu'à tes oreilles... puis laisse-les retomber lourdement.

# bsPeacefulFaceTitle
source: Peaceful Face
ar: وجه مسالم
fr: Visage apaisé

# bsPeacefulFaceDesc
source: Smile big... then relax your face completely. You are doing great!
ar: ابتسم ابتسامة عريضة... ثم أرخِ وجهك تماماً. أنت تقوم بعمل رائع!
fr: Fais un grand sourire... puis détends complètement ton visage. Tu te débrouilles super bien !

# bsPeacefulButton
source: I feel peaceful
ar: أشعر بالسلام
fr: Je me sens apaisé

# dtGreatJob
source: Great Job!
ar: عمل رائع!
fr: Bien joué !

# dtSessionFinished
source: You finished your focus session!
ar: لقد أنهيت جلسة التركيز الخاصة بك!
fr: Tu as terminé ta séance de concentration !

# dtAwesome
source: Awesome!
ar: رائع!
fr: Génial !

# dtProgress
source: {completed} of {total} completed
ar: تم إنجاز {completed} من أصل {total}
fr: {completed} sur {total} terminés

# dtTaskList
source: Tasks list
ar: قائمة المهام
fr: Liste des tâches

# dtNoTasks
source: No tasks for today
ar: لا توجد مهام اليوم
fr: Aucune tâche pour aujourd'hui

# dtNoTasksDesc
source: Add a task to start your day!
ar: أضف مهمة لتبدأ يومك!
fr: Ajoute une tâche pour commencer ta journée !

# galleryPermissionRequired
source: Gallery permission is required to save drawings.
ar: إذن المعرض مطلوب لحفظ الرسومات.
fr: L'autorisation d'accès à la galerie est requise pour enregistrer les dessins.

source: Saved to Gallery! 🎨
ar: تم الحفظ في المعرض! 🎨
fr: Enregistré dans la galerie ! 🎨

# galleryError
source: Gallery Error: {error}
ar: خطأ في المعرض: {error}
fr: Erreur de galerie : {error}

# saveError
source: Save Error: {error}
ar: خطأ في الحفظ: {error}
fr: Erreur d'enregistrement : {error}

source: Error loading stories
ar: خطأ في تحميل القصص
fr: Erreur lors du chargement des histoires

source: No stories available
ar: لا توجد قصص متاحة
fr: Aucune histoire disponible

# pagesCount
source: {count} pages
ar: {count} صفحات

# pageIndicator
source: Page {current} of {total}
ar: صفحة {current} من {total}
fr: Page {current} sur {total}

source: Swipe to turn page
ar: اسحب لقلب الصفحة
fr: Balaye pour tourner la page

source: The End
ar: النهاية
fr: Fin

source: Live Heartbeat & Motion
ar: نبضات القلب والحركة الحية
fr: Rythme Cardiaque et Mouvement en Direct

source: Motion (Z)
ar: الحركة (Z)
fr: Mouvement (Z)

source: Energy
ar: الطاقة
fr: Énergie

# liveTag
source: LIVE
ar: مباشر
fr: DIRECT

# achFirstBreathing
source: First Breath
ar: النفس الأول
fr: Premier Souffle

# achFirstBreathingDesc
source: Complete your first breathing exercise.
ar: أكمل أول تمرين تنفس لك.
fr: Terminez votre premier exercice de respiration.

# achBreathing5
source: Breathing Steady
ar: تنفس مستقر
fr: Respiration Constante

# achBreathing5Desc
source: Complete 5 breathing exercises.
ar: أكمل 5 تمارين تنفس.
fr: Terminez 5 exercices de respiration.

# achBreathing10
source: Breathing Expert
ar: خبير تنفس
fr: Expert en Respiration

# achBreathing10Desc
source: Complete 10 breathing exercises.
ar: أكمل 10 تمارين تنفس.
fr: Terminez 10 exercices de respiration.

# achBreathingMaster
source: Breathing Master
ar: ماستر التنفس
fr: Maître de la Respiration

# achBreathingMasterDesc
source: Complete 30 breathing exercises.
ar: أكمل 30 تمرين تنفس.
fr: Terminez 30 exercices de respiration.

# achFirstFocus
source: Focused Mind
ar: عقل مركز
fr: Esprit Focalisé

# achFirstFocusDesc
source: Complete your first focus exercise.
ar: أكمل أول تمرين تركيز لك.
fr: Terminez votre premier exercice de concentration.

# achFocusChampion
source: Focus Champion
ar: بطل التركيز
fr: Champion de la Concentration

# achFocusChampionDesc
source: Complete 20 focus exercises.
ar: أكمل 20 تمرين تركيز.
fr: Terminez 20 exercices de concentration.

# achMusicBeginner
source: Musical Soul
ar: روح موسيقية
fr: Âme Musicale

# achMusicBeginnerDesc
source: Listen to 5 calming tracks.
ar: استمع إلى 5 مقاطع هادئة.
fr: Écoutez 5 pistes apaisantes.

# achMusicExpert
source: Music Enthusiast
ar: عاشق الموسيقى
fr: Enthousiaste de Musique

# achMusicExpertDesc
source: Listen to 25 calming tracks.
ar: استمع إلى 25 مقطعاً هادئاً.
fr: Écoutez 25 pistes apaisantes.

# achStoryStarter
source: Story Listener
ar: مستمع القصص
fr: Auditeur d'Histoires

# achStoryStarterDesc
source: Listen to 3 stories.
ar: استمع إلى 3 قصص.
fr: Écoutez 3 histoires.

# achStoryMaster
source: Fable Fanatic
ar: عاشق الحكايات
fr: Fanatique de Fables

# achStoryMasterDesc
source: Listen to 15 stories.
ar: استمع إلى 15 قصة.
fr: Écoutez 15 histoires.

# weekLabel
source: Week {count} of 5
ar: الأسبوع {weekNum}
fr: Semaine {weekNum}

# weekPrefix
source: WEEK
ar: الأسبوع
fr: SEMAINE

# continueTraining
source: Continue training habits
ar: استمر في عادات التدريب
fr: Continue les habitudes d'entraînement

source: Focus Quest
ar: مهمة التركيز
fr: Quête de concentration

source: Mindful Stories
ar: قصص واعية
fr: Histoires de pleine conscience

source: Calming Rhythms
ar: إيقاعات مهدئة
fr: Rythmes apaisants

source: Final Discovery Dashboard
ar: لوحة الاستكشاف النهائية
fr: Tableau de bord du protocole Carré Manquant

source: Protocol Analytics
ar: تحليلات البروتوكول
fr: Analytique du protocole

source: Avg Stress Level
ar: متوسط مستوى التوتر
fr: Niveau de stress moyen

source: Avg Activity Level
ar: متوسط مستوى النشاط
fr: Niveau d'activité moyen

source: Weekly Breakdown
ar: التقسيم الأسبوعي
fr: Répartition hebdomadaire

# noProtocolData
source: No Protocol Data Yet
ar: لا تتوفر بيانات البروتوكول
fr: Pas encore de données de protocole

# noProtocolDataDesc
source: Stats will appear as you complete activities.
ar: ستظهر الإحصائيات عند إكمال الأنشطة.
fr: Les statistiques apparaîtront au fur et à mesure de l'achèvement des activités.

# weekDetail
source: Week {index}
ar: الأسبوع {index}
fr: Semaine {index}

# sessionsCount
source: {count} sessions
ar: {count} جلسات

# stressPercentage
source: {percentage}% Stress
ar: {percentage}% توتر

# achStreak3
source: 3 Day Streak
ar: سلسلة لـ 3 أيام
fr: Série de 3 Jours

# achStreak3Desc
source: Maintain a 3-day activity streak.
ar: حافظ على سلسلة نشاط لمدة 3 أيام.
fr: Maintenez une série d'activité de 3 jours.

# achStreak7
source: Week Warrior
ar: محارب الأسبوع
fr: Guerrier de la Semaine

# achStreak7Desc
source: Maintain a 7-day activity streak.
ar: حافظ على سلسلة نشاط لمدة 7 أيام.
fr: Maintenez une série d'activité de 7 jours.

# achStreak14
source: Two Week Triumph
ar: انتصار الأسبوعين
fr: Triomphe de Deux Semaines

# achStreak14Desc
source: Maintain a 14-day activity streak.
ar: حافظ على سلسلة نشاط لمدة 14 يوماً.
fr: Maintenez une série d'activité de 14 jours.

# achStreak30
source: Monthly Master
ar: ماستر الشهر
fr: Maître Mensuel

# achStreak30Desc
source: Maintain a 30-day activity streak.
ar: حافظ على سلسلة نشاط لمدة 30 يوماً.
fr: Maintenez une série d'activité de 30 jours.

# achEarlyBird
source: Early Bird
ar: الطير المبكر
fr: Lève-tôt

# achEarlyBirdDesc
source: Complete 5 sessions before 9 AM.
ar: أكمل 5 جلسات قبل الساعة 9 صباحاً.
fr: Terminez 5 sessions avant 9h du matin.

# achCalm10
source: 10 Minutes of Calm
ar: 10 دقائق من الهدوء
fr: 10 Minutes de Calme

# achCalm10Desc
source: Stay in a calm state for 10 minutes.
ar: ابقَ في حالة هدوء لمدة 10 دقائق.
fr: Restez dans un état calme pendant 10 minutes.

# achCalm30
source: 30 Minutes of Calm
ar: 30 دقيقة من الهدوء
fr: 30 Minutes de Calme

# achCalm30Desc
source: Stay in a calm state for 30 minutes.
ar: ابقَ في حالة هدوء لمدة 30 دقيقة.
fr: Restez dans un état calme pendant 30 minutes.

# achCalm60
source: Hour of Peace
ar: ساعة من السلام
fr: Heure de Paix

# achCalm60Desc
source: Stay in a calm state for 1 hour.
ar: ابقَ في حالة هدوء لمدة ساعة.
fr: Restez dans un état calme pendant 1 heure.

# achReduceHyper20
source: Hyperactivity Reducer
ar: مقلل النشاط الزائد
fr: Réducteur d'Hyperactivité

# achReduceHyper20Desc
source: Reduce hyperactivity by 20% in a session.
ar: قلل النشاط الزائد بنسبة 20% في الجلسة.
fr: Réduisez l'hyperactivité de 20% lors d'une session.

# achReduceHyper50
source: Calmness King
ar: ملك الهدوء
fr: Roi du Calme

# achReduceHyper50Desc
source: Reduce hyperactivity by 50% in a session.
ar: قلل النشاط الزائد بنسبة 50% في الجلسة.
fr: Réduisez l'hyperactivité de 50% lors d'une session.

# achPerfectPosture
source: Perfect Balance
ar: توازن مثالي
fr: Équilibre Parfait

# achPerfectPostureDesc
source: Maintain perfect posture for 15 minutes.
ar: حافظ على وضعية جسم مثالية لمدة 15 دقيقة.
fr: Maintenez une posture parfaite pendant 15 minutes.

# achFirstDay
source: Day One
ar: اليوم الأول
fr: Premier Jour

# achFirstDayDesc
source: Complete your first day with the protocol.
ar: أكمل يومك الأول مع البروتوكول.
fr: Terminez votre premier jour avec le protocole.

# achFirstWeek
source: Seven Day Success
ar: نجاح السبعة أيام
fr: Succès de Sept Jours

# achFirstWeekDesc
source: Complete your first full week.
ar: أكمل أول أسبوع كامل لك.
fr: Terminez votre première semaine complète.

# achFirstMonth
source: Protocol Pro
ar: محترف البروتوكول
fr: Pro du Protocole

# achFirstMonthDesc
source: Complete your first full month.
ar: أكمل أول شهر كامل لك.
fr: Terminez votre premier mois complet.

# achTasks100
source: Centurion
ar: المئوي

# achTasks100Desc
source: Complete 100 protocol tasks.
ar: أكمل 100 مهمة بروتوكول.
fr: Terminez 100 tâches du protocole.

# achTasks500
source: Halfway to a Thousand
ar: منتصف الطريق إلى الألف
fr: À Moitié Chemin de Mille

# achTasks500Desc
source: Complete 500 protocol tasks.
ar: أكمل 500 مهمة بروتوكول.
fr: Terminez 500 tâches du protocole.

# achTasks1000
source: Task Titan
ar: عملاق المهام
fr: Titan des Tâches

# achTasks1000Desc
source: Complete 1000 protocol tasks.
ar: أكمل 1000 مهمة بروتوكول.
fr: Terminez 1000 tâches du protocole.

# achQuickLearner
source: Quick Learner
ar: متعلم سريع
fr: Apprenti Rapide

# achQuickLearnerDesc
source: Complete 5 new exercises in one day.
ar: أكمل 5 تمارين جديدة في يوم واحد.
fr: Terminez 5 nouveaux exercices en une journée.

# achOverachiever
source: Overachiever
ar: متفوق
fr: Surdoué

# achOverachieverDesc
source: Complete all protocol tasks 7 days in a row.
ar: أكمل جميع مهام البروتوكول لـ 7 أيام متتالية.
fr: Terminez toutes les tâches du protocole 7 jours de suite.

# achCalmMaster
source: Zen Master
ar: ماستر زين
fr: Maître Zen

# achCalmMasterDesc
source: Maintain peak calmness during a difficult task.
ar: حافظ على قمة الهدوء خلال مهمة صعبة.
fr: Maintenez un calme maximal lors d'une tâche difficile.

# achExplorer
source: Curious Explorer
ar: مستكشف فضولي
fr: Explorateur Curieux

# achExplorerDesc
source: Try every type of exercise at least once.
ar: جرب كل نوع من التمارين مرة واحدة على الأقل.
fr: Essayez chaque type d'exercice au moins une fois.

# rarityCommon
source: Common
ar: شائع
fr: Commun

# rarityRare
source: Rare
ar: نادر

# rarityEpic
source: Epic
ar: ملحمي
fr: Épique

# rarityLegendary
source: Legendary
ar: أسطوري
fr: Légendaire

source: How to Unlock
ar: طريقة الفتح
fr: Comment débloquer

# achievementUnlocked
source: Unlocked
ar: تم الفتح
fr: Débloqué

# achievementLocked
source: Locked
ar: مغلق
fr: Verrouillé

# achProgress
source: Progress
ar: التقدم
fr: Progrès

# achPointsCount
source: +{count} Points
ar: +{count} نقاط

# achUnlockedTitle
source: Unlocked!
ar: تم الفتح!
fr: Débloqué !

# loginToViewAchievements
source: Please log in to view achievements
ar: يرجى تسجيل الدخول لعرض الإنجازات
fr: Veuillez vous connecter pour voir vos trophées

source: Error loading achievements
ar: خطأ في تحميل الإنجازات
fr: Erreur lors du chargement des trophées

# totalPointsLabel
source: Total Points
ar: إجمالي النقاط
fr: Points Totaux

# levelIndicator
source: Level {level}
ar: المستوى {level}
fr: Niveau {level}

# achievementsCount
source: {unlocked}/{total} Achievements
ar: {unlocked}/{total} إنجازات
fr: {unlocked}/{total} Trophées

# categoryAll
source: All
ar: الكل
fr: Tout

# categoryExercise
source: Exercise
ar: تمارين
fr: Exercice

# categoryStreaks
source: Streaks
ar: سلاسل
fr: Séries

# categoryCalm
source: Calm
ar: هدوء
fr: Calme

# categoryMilestones
source: Milestones
ar: إنجازات رئيسية
fr: Étapes

# categorySpecial
source: Special
ar: خاص
fr: Spécial

source: Show only unlocked
ar: إظهار المفتوحة فقط
fr: Voir uniquement débloqués

source: No achievements found
ar: لم يتم العثور على إنجازات
fr: Aucun trophée trouvé

source: seconds
fr: secondes
